TuanPT176/BLE_Wearable/STM32_BLE/App/wearable_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    WEARABLE_app.c
  * @author  MCD Application Team
  * @brief   WEARABLE_app application definition.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "app_ble.h"
#include "ble.h"
#include "wearable_app.h"
#include "wearable.h"
#include "stm32_seq.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32wb0x_hal_radio_timer.h"
#include "../../Application/sensor_manager.h"
#include "../../Application/wearable_data.h"
#include "../../Application/wearable_state_manager.h"
#include "../../Application/device_time.h"
#include "../../Application/data_recovery_manager.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */
typedef enum
{
  WEARABLE_CMD_START_MEASUREMENT = 0x01,
  WEARABLE_CMD_STOP_MEASUREMENT  = 0x02,
  WEARABLE_CMD_REQUEST_DATA      = 0x03,
  WEARABLE_CMD_NORMAL_MODE       = 0x04,
  WEARABLE_CMD_LOW_POWER_MODE    = 0x05,
  WEARABLE_CMD_ECG_START         = 0x06,
  WEARABLE_CMD_ECG_STOP          = 0x07,
  WEARABLE_CMD_EMERGENCY_TEST    = 0x08,
  WEARABLE_CMD_SYNC_TIME         = 0x09,
  WEARABLE_CMD_GET_RECOVERY_INFO = 0x0A,
  WEARABLE_CMD_START_BLE_RECOVERY= 0x0B,
  WEARABLE_CMD_STOP_BLE_RECOVERY = 0x0C,
  WEARABLE_CMD_RECOVERY_ACK      = 0x0D,
  WEARABLE_CMD_RECOVERY_CLEAR    = 0x0E
} wearable_command_t;

typedef enum
{
  DEBUG_CMD_SET_SENSOR_RATE   = 0x01,
  DEBUG_CMD_SET_BLE_INTERVAL  = 0x02,
  DEBUG_CMD_SET_LOG_INTERVAL  = 0x03,
  DEBUG_CMD_SET_POWER_THRESH  = 0x04,
  DEBUG_CMD_GET_POWER_STATS   = 0x05,
  DEBUG_CMD_GET_LOG_INFO      = 0x06,
  DEBUG_CMD_GET_SENSOR_STATUS = 0x07
} debug_command_t;

/* USER CODE END PTD */

typedef enum
{
  Sensor_data_NOTIFICATION_OFF,
  Sensor_data_NOTIFICATION_ON,
  Device_status_NOTIFICATION_OFF,
  Device_status_NOTIFICATION_ON,
  Nfc_data_NOTIFICATION_OFF,
  Nfc_data_NOTIFICATION_ON,
  Ecg_data_NOTIFICATION_OFF,
  Ecg_data_NOTIFICATION_ON,
  Debug_data_NOTIFICATION_OFF,
  Debug_data_NOTIFICATION_ON,
  Recovery_data_NOTIFICATION_OFF,
  Recovery_data_NOTIFICATION_ON,
  /* USER CODE BEGIN Service1_APP_SendInformation_t */

  /* USER CODE END Service1_APP_SendInformation_t */
  WEARABLE_APP_SENDINFORMATION_LAST
} WEARABLE_APP_SendInformation_t;

typedef struct
{
  WEARABLE_APP_SendInformation_t     Sensor_data_Notification_Status;
  WEARABLE_APP_SendInformation_t     Device_status_Notification_Status;
  WEARABLE_APP_SendInformation_t     Nfc_data_Notification_Status;
  WEARABLE_APP_SendInformation_t     Ecg_data_Notification_Status;
  WEARABLE_APP_SendInformation_t     Debug_data_Notification_Status;
  WEARABLE_APP_SendInformation_t     Recovery_data_Notification_Status;
  /* USER CODE BEGIN Service1_APP_Context_t */
  uint8_t ResetCounter;
  uint8_t ErrorCode;
  /* USER CODE END Service1_APP_Context_t */
  uint16_t              ConnectionHandle;
} WEARABLE_APP_Context_t;

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define WEARABLE_SENSOR_PERIOD_MS       1000U
#define WEARABLE_ERROR_NONE              0x00U
#define WEARABLE_ERROR_INVALID_COMMAND   0x01U
#define WEARABLE_ERROR_TEMP_NOT_PRESENT  0x10U
#define WEARABLE_ERROR_TEMP_TIMEOUT      0x11U
#define WEARABLE_ERROR_TEMP_BUS          0x12U
/* USER CODE END PD */

/* External variables --------------------------------------------------------*/
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
static WEARABLE_APP_Context_t WEARABLE_APP_Context;

uint8_t a_WEARABLE_UpdateCharData[247];

/* USER CODE BEGIN PV */
static VTIMER_HandleType wearable_sensor_timer;
static VTIMER_HandleType wearable_sensor_async_timer;
static VTIMER_HandleType wearable_motion_timer;
static uint8_t wearable_sensor_snapshot[WEARABLE_SENSOR_PAYLOAD_LENGTH];
static uint8_t wearable_status_snapshot[WEARABLE_STATUS_PAYLOAD_LENGTH];
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void WEARABLE_Sensor_data_SendNotification(void);
static void WEARABLE_Device_status_SendNotification(void);
static void WEARABLE_Nfc_data_SendNotification(void);
static void WEARABLE_Ecg_data_SendNotification(void);
static void WEARABLE_Debug_data_SendNotification(void);
static void WEARABLE_Recovery_data_SendNotification(void);

/* USER CODE BEGIN PFP */
static void WEARABLE_SensorTask(void);
static void WEARABLE_SensorTimerCallback(void *arg);
static void WEARABLE_SensorAsyncTask(void);
static void WEARABLE_MotionInterruptTask(void);
static void WEARABLE_MotionTimeoutTask(void);
static void WEARABLE_MotionTimerCallback(void *arg);
static void WEARABLE_ScheduleMotionTimeout(void);
static void WEARABLE_SensorAsyncTimerCallback(void *arg);
static void WEARABLE_ScheduleSensorAsyncTask(void);
static void WEARABLE_StopSensorAsyncTask(void);
static void WEARABLE_FillSensorPayload(uint8_t *payload);
static void WEARABLE_RefreshSensorSnapshot(void);
static void WEARABLE_RefreshStatusSnapshot(void);
static void WEARABLE_SendStatus(void);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void WEARABLE_Notification(WEARABLE_NotificationEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service1_Notification_1 */

  /* USER CODE END Service1_Notification_1 */
  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service1_Notification_Service1_EvtOpcode */

    /* USER CODE END Service1_Notification_Service1_EvtOpcode */

    case WEARABLE_CONTROL_WRITE_EVT:
      /* USER CODE BEGIN Service1Char1_WRITE_EVT */
      if ((p_Notification->DataTransfered.Length == 0U) ||
          (p_Notification->DataTransfered.p_Payload == NULL))
      {
        APP_DBG_MSG("-- WEARABLE COMMAND: EMPTY PAYLOAD\n");
        break;
      }

      switch ((wearable_command_t)p_Notification->DataTransfered.p_Payload[0])
      {
        case WEARABLE_CMD_START_MEASUREMENT:
          WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_NONE;
          if (SensorManager_Start())
          {
            WearableState_Set(WEARABLE_STATE_MEASURING);
            HAL_RADIO_TIMER_StopVirtualTimer(&wearable_sensor_timer);
            HAL_RADIO_TIMER_StartVirtualTimer(&wearable_sensor_timer, WEARABLE_SENSOR_PERIOD_MS);
            WEARABLE_ScheduleSensorAsyncTask();
          }
          else
          {
            WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_INVALID_COMMAND;
            WearableState_Set(WEARABLE_STATE_ERROR);
          }
          APP_DBG_MSG("-- WEARABLE COMMAND: START MEASUREMENT\n");
          break;

        case WEARABLE_CMD_STOP_MEASUREMENT:
          WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_NONE;
          SensorManager_Stop();
          WearableState_Set(WEARABLE_STATE_IDLE);
          HAL_RADIO_TIMER_StopVirtualTimer(&wearable_sensor_timer);
          WEARABLE_StopSensorAsyncTask();
          APP_DBG_MSG("-- WEARABLE COMMAND: STOP MEASUREMENT\n");
          break;

        case WEARABLE_CMD_REQUEST_DATA:
          WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_NONE;
          UTIL_SEQ_SetTask(1U << CFG_TASK_WEARABLE_SENSOR_ID, CFG_SEQ_PRIO_0);
          APP_DBG_MSG("-- WEARABLE COMMAND: REQUEST CURRENT DATA\n");
          break;

