TuanPT176/BLE_Wearable/STM32_BLE/App/wearable_app.c
        case WEARABLE_CMD_NORMAL_MODE:
          WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_NONE;
          SensorManager_SetPowerState(1U);
          if (WearableState_Get() == WEARABLE_STATE_LOW_POWER)
          {
            WearableState_Set(WEARABLE_STATE_IDLE);
          }
          WEARABLE_SendStatus();
          break;

        case WEARABLE_CMD_LOW_POWER_MODE:
          WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_NONE;
          SensorManager_Stop();
          SensorManager_SetPowerState(2U);
          WearableState_Set(WEARABLE_STATE_LOW_POWER);
          HAL_RADIO_TIMER_StopVirtualTimer(&wearable_sensor_timer);
          WEARABLE_StopSensorAsyncTask();
          WEARABLE_SendStatus();
          break;

        case WEARABLE_CMD_ECG_START:
          WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_NONE;
          SensorManager_Start();
          SensorManager_SetFlag(WEARABLE_FLAG_ECG_ACTIVE, true);
          WearableState_Set(WEARABLE_STATE_ECG_ACTIVE);
          HAL_RADIO_TIMER_StopVirtualTimer(&wearable_sensor_timer);
          HAL_RADIO_TIMER_StartVirtualTimer(&wearable_sensor_timer, WEARABLE_SENSOR_PERIOD_MS);
          WEARABLE_ScheduleSensorAsyncTask();
          WEARABLE_SendStatus();
          break;

        case WEARABLE_CMD_ECG_STOP:
          WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_NONE;
          SensorManager_Stop();
          SensorManager_SetFlag(WEARABLE_FLAG_ECG_ACTIVE, false);
          WearableState_Set(WEARABLE_STATE_IDLE);
          HAL_RADIO_TIMER_StopVirtualTimer(&wearable_sensor_timer);
          WEARABLE_StopSensorAsyncTask();
          WEARABLE_SendStatus();
          break;

        case WEARABLE_CMD_EMERGENCY_TEST:
          WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_NONE;
          SensorManager_SetFlag(WEARABLE_FLAG_EMERGENCY, true);
          WearableState_Set(WEARABLE_STATE_EMERGENCY);
          HAL_RADIO_TIMER_StopVirtualTimer(&wearable_sensor_timer);
          WEARABLE_SendStatus();
          break;

        case WEARABLE_CMD_SYNC_TIME:
          if (p_Notification->DataTransfered.Length < 8)
          {
            WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_INVALID_COMMAND;
            APP_DBG_MSG("-- WEARABLE TIME: SYNC FAILED\nReason: INVALID LENGTH\n");
          }
          else
          {
            uint8_t *payload = p_Notification->DataTransfered.p_Payload;
            if (payload[7] != 0)
            {
              WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_INVALID_COMMAND;
              APP_DBG_MSG("-- WEARABLE TIME: SYNC FAILED\nReason: RESERVED BYTE NON-ZERO\n");
            }
            else
            {
              uint32_t seconds = (uint32_t)payload[1] | ((uint32_t)payload[2] << 8) | ((uint32_t)payload[3] << 16) | ((uint32_t)payload[4] << 24);
              uint16_t millis = (uint16_t)payload[5] | ((uint16_t)payload[6] << 8);

              if (millis > 999)
              {
                WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_INVALID_COMMAND;
                APP_DBG_MSG("-- WEARABLE TIME: SYNC FAILED\nReason: INVALID MILLIS\n");
              }
              else if (DeviceTime_SetUnixTime(seconds, millis))
              {
                WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_NONE;
                APP_DBG_MSG("-- WEARABLE TIME: SYNC SUCCESS\nUnix seconds: %lu\nMilliseconds: %u\nDevice synchronized: YES\n", (unsigned long)seconds, (unsigned int)millis);
              }
              else
              {
                WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_INVALID_COMMAND;
                APP_DBG_MSG("-- WEARABLE TIME: SYNC FAILED\nReason: INTERNAL ERROR\n");
              }
            }
          }
          break;

        case WEARABLE_CMD_GET_RECOVERY_INFO:
          WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_NONE;
          // Trigger something to send recovery info if needed
          break;

        case WEARABLE_CMD_START_BLE_RECOVERY:
          if (p_Notification->DataTransfered.Length >= 3) {
             uint16_t start_seq = (uint16_t)p_Notification->DataTransfered.p_Payload[1] |
                                  ((uint16_t)p_Notification->DataTransfered.p_Payload[2] << 8);
             DataRecovery_StartBLERecovery(start_seq);
          }
          break;

        case WEARABLE_CMD_STOP_BLE_RECOVERY:
          DataRecovery_StopBLERecovery();
          break;

        case WEARABLE_CMD_RECOVERY_ACK:
          if (p_Notification->DataTransfered.Length >= 3) {
             uint16_t ack_seq = (uint16_t)p_Notification->DataTransfered.p_Payload[1] |
                                ((uint16_t)p_Notification->DataTransfered.p_Payload[2] << 8);
             DataRecovery_HandleACK(ack_seq);
          }
          break;

        case WEARABLE_CMD_RECOVERY_CLEAR:
          DataRecovery_Clear();
          break;

        default:
          WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_INVALID_COMMAND;
          WearableState_Set(WEARABLE_STATE_ERROR);
          WEARABLE_RefreshStatusSnapshot();
          APP_DBG_MSG("-- WEARABLE COMMAND: UNSUPPORTED 0x%02X\n",
                      p_Notification->DataTransfered.p_Payload[0]);
          break;
      }
      /* USER CODE END Service1Char1_WRITE_EVT */
      break;

    case WEARABLE_SENSOR_DATA_READ_EVT:
      /* USER CODE BEGIN Service1Char2_READ_EVT */

      /* USER CODE END Service1Char2_READ_EVT */
      break;

    case WEARABLE_SENSOR_DATA_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char2_NOTIFY_ENABLED_EVT */
      WEARABLE_APP_Context.Sensor_data_Notification_Status = Sensor_data_NOTIFICATION_ON;
      if (WearableState_AllowsPeriodicMeasurement())
      {
        HAL_RADIO_TIMER_StopVirtualTimer(&wearable_sensor_timer);
        HAL_RADIO_TIMER_StartVirtualTimer(&wearable_sensor_timer, WEARABLE_SENSOR_PERIOD_MS);
      }
      /* USER CODE END Service1Char2_NOTIFY_ENABLED_EVT */
      break;

    case WEARABLE_SENSOR_DATA_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char2_NOTIFY_DISABLED_EVT */
      WEARABLE_APP_Context.Sensor_data_Notification_Status = Sensor_data_NOTIFICATION_OFF;
      /* USER CODE END Service1Char2_NOTIFY_DISABLED_EVT */
      break;

