TuanPT176/BLE_Wearable/STM32_BLE/App/wearable_app.c
    case WEARABLE_DEVICE_STATUS_READ_EVT:
      /* USER CODE BEGIN Service1Char3_READ_EVT */

      /* USER CODE END Service1Char3_READ_EVT */
      break;

    case WEARABLE_DEVICE_STATUS_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char3_NOTIFY_ENABLED_EVT */
      WEARABLE_APP_Context.Device_status_Notification_Status = Device_status_NOTIFICATION_ON;
      WEARABLE_SendStatus();
      /* USER CODE END Service1Char3_NOTIFY_ENABLED_EVT */
      break;

    case WEARABLE_DEVICE_STATUS_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char3_NOTIFY_DISABLED_EVT */
      WEARABLE_APP_Context.Device_status_Notification_Status = Device_status_NOTIFICATION_OFF;
      /* USER CODE END Service1Char3_NOTIFY_DISABLED_EVT */
      break;

    case WEARABLE_NFC_DATA_READ_EVT:
      /* USER CODE BEGIN Service1Char4_READ_EVT */

      /* USER CODE END Service1Char4_READ_EVT */
      break;

    case WEARABLE_NFC_DATA_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char4_NOTIFY_ENABLED_EVT */

      /* USER CODE END Service1Char4_NOTIFY_ENABLED_EVT */
      break;

    case WEARABLE_NFC_DATA_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char4_NOTIFY_DISABLED_EVT */

      /* USER CODE END Service1Char4_NOTIFY_DISABLED_EVT */
      break;

    case WEARABLE_ECG_DATA_READ_EVT:
      /* USER CODE BEGIN Service1Char5_READ_EVT */

      /* USER CODE END Service1Char5_READ_EVT */
      break;

    case WEARABLE_ECG_DATA_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char5_NOTIFY_ENABLED_EVT */

      /* USER CODE END Service1Char5_NOTIFY_ENABLED_EVT */
      break;

    case WEARABLE_ECG_DATA_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char5_NOTIFY_DISABLED_EVT */

      /* USER CODE END Service1Char5_NOTIFY_DISABLED_EVT */
      break;

    case WEARABLE_DEBUG_DATA_READ_EVT:
      /* USER CODE BEGIN Service1Char6_READ_EVT */

      /* USER CODE END Service1Char6_READ_EVT */
      break;

    case WEARABLE_DEBUG_DATA_WRITE_EVT:
      /* USER CODE BEGIN Service1Char6_WRITE_EVT */

      /* USER CODE END Service1Char6_WRITE_EVT */
      break;

    case WEARABLE_DEBUG_DATA_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char6_NOTIFY_ENABLED_EVT */

      /* USER CODE END Service1Char6_NOTIFY_ENABLED_EVT */
      break;

    case WEARABLE_DEBUG_DATA_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char6_NOTIFY_DISABLED_EVT */

      /* USER CODE END Service1Char6_NOTIFY_DISABLED_EVT */
      break;

    case WEARABLE_RECOVERY_DATA_READ_EVT:
      /* USER CODE BEGIN Service1Char7_READ_EVT */

      /* USER CODE END Service1Char7_READ_EVT */
      break;

    case WEARABLE_RECOVERY_DATA_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char7_NOTIFY_ENABLED_EVT */

      /* USER CODE END Service1Char7_NOTIFY_ENABLED_EVT */
      break;

    case WEARABLE_RECOVERY_DATA_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char7_NOTIFY_DISABLED_EVT */

      /* USER CODE END Service1Char7_NOTIFY_DISABLED_EVT */
      break;

    default:
      /* USER CODE BEGIN Service1_Notification_default */

      /* USER CODE END Service1_Notification_default */
      break;
  }
  /* USER CODE BEGIN Service1_Notification_2 */

  /* USER CODE END Service1_Notification_2 */
  return;
}

void WEARABLE_APP_EvtRx(WEARABLE_APP_ConnHandleNotEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service1_APP_EvtRx_1 */

  /* USER CODE END Service1_APP_EvtRx_1 */

  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service1_APP_EvtRx_Service1_EvtOpcode */

    /* USER CODE END Service1_APP_EvtRx_Service1_EvtOpcode */
    case WEARABLE_CONN_HANDLE_EVT :
      WEARABLE_APP_Context.ConnectionHandle = p_Notification->ConnectionHandle;
      /* USER CODE BEGIN Service1_APP_CENTR_CONN_HANDLE_EVT */

      /* USER CODE END Service1_APP_CENTR_CONN_HANDLE_EVT */
      break;
    case WEARABLE_DISCON_HANDLE_EVT :
      WEARABLE_APP_Context.ConnectionHandle = 0xFFFF;
      /* USER CODE BEGIN Service1_APP_DISCON_HANDLE_EVT */
      WEARABLE_APP_Context.Sensor_data_Notification_Status = Sensor_data_NOTIFICATION_OFF;
      WEARABLE_APP_Context.Device_status_Notification_Status = Device_status_NOTIFICATION_OFF;
      HAL_RADIO_TIMER_StopVirtualTimer(&wearable_sensor_timer);
      WEARABLE_StopSensorAsyncTask();
      SensorManager_Stop();
      WearableState_Set(WEARABLE_STATE_IDLE);
      /* USER CODE END Service1_APP_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN Service1_APP_EvtRx_default */

      /* USER CODE END Service1_APP_EvtRx_default */
      break;
  }

  /* USER CODE BEGIN Service1_APP_EvtRx_2 */

  /* USER CODE END Service1_APP_EvtRx_2 */

  return;
}

void WEARABLE_APP_Init(void)
{
  WEARABLE_APP_Context.ConnectionHandle = 0xFFFF;
  WEARABLE_Init();

  /* USER CODE BEGIN Service1_APP_Init */
  DeviceTime_Init();
  WEARABLE_APP_Context.Sensor_data_Notification_Status = Sensor_data_NOTIFICATION_OFF;
  WEARABLE_APP_Context.Device_status_Notification_Status = Device_status_NOTIFICATION_OFF;
  WEARABLE_APP_Context.ResetCounter = 0U;
  WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_NONE;
  WearableState_Init();
  if (!SensorManager_Init())
  {
    WEARABLE_APP_Context.ErrorCode = WEARABLE_ERROR_INVALID_COMMAND;
    WearableState_Set(WEARABLE_STATE_ERROR);
  }
  wearable_sensor_timer.callback = WEARABLE_SensorTimerCallback;
  wearable_sensor_async_timer.callback = WEARABLE_SensorAsyncTimerCallback;
  wearable_motion_timer.callback = WEARABLE_MotionTimerCallback;
  UTIL_SEQ_RegTask(1U << CFG_TASK_WEARABLE_SENSOR_ID, UTIL_SEQ_RFU, WEARABLE_SensorTask);
  UTIL_SEQ_RegTask(1U << CFG_TASK_WEARABLE_SENSOR_ASYNC_ID, UTIL_SEQ_RFU, WEARABLE_SensorAsyncTask);
  UTIL_SEQ_RegTask(1U << CFG_TASK_WEARABLE_MOTION_INT_ID, UTIL_SEQ_RFU, WEARABLE_MotionInterruptTask);
  UTIL_SEQ_RegTask(1U << CFG_TASK_WEARABLE_MOTION_TIMEOUT_ID, UTIL_SEQ_RFU, WEARABLE_MotionTimeoutTask);
  WEARABLE_RefreshSensorSnapshot();
  WEARABLE_RefreshStatusSnapshot();
  /* USER CODE END Service1_APP_Init */
  return;
}

/* USER CODE BEGIN FD */
const uint8_t *WEARABLE_APP_GetLatestSensorData(uint16_t *length)
{
  if (length != NULL)
  {
    *length = WEARABLE_SENSOR_PAYLOAD_LENGTH;
  }
  return wearable_sensor_snapshot;
}

const uint8_t *WEARABLE_APP_GetLatestDeviceStatus(uint16_t *length)
{
  WEARABLE_RefreshStatusSnapshot();
  if (length != NULL)
  {
    *length = WEARABLE_STATUS_PAYLOAD_LENGTH;
  }
  return wearable_status_snapshot;
}

void WEARABLE_APP_NotifyMotionInterruptFromISR(void)
{
  /* PB2 ISR only schedules work; the task performs all I2C accesses. */
  UTIL_SEQ_SetTask(1U << CFG_TASK_WEARABLE_MOTION_INT_ID, CFG_SEQ_PRIO_0);
}
/* USER CODE END FD */

