TuanPT176/BLE_Wearable/STM32_BLE/App/wearable_app.c
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
__USED void WEARABLE_Sensor_data_SendNotification(void) /* Property Notification */
{
  WEARABLE_APP_SendInformation_t notification_on_off = Sensor_data_NOTIFICATION_OFF;
  WEARABLE_Data_t wearable_notification_data;

  wearable_notification_data.p_Payload = (uint8_t*)a_WEARABLE_UpdateCharData;
  wearable_notification_data.Length = 0;

  /* USER CODE BEGIN Service1Char2_NS_1*/
  memcpy(a_WEARABLE_UpdateCharData, wearable_sensor_snapshot, WEARABLE_SENSOR_PAYLOAD_LENGTH);
  wearable_notification_data.Length = WEARABLE_SENSOR_PAYLOAD_LENGTH;
  if (WEARABLE_APP_Context.Sensor_data_Notification_Status == Sensor_data_NOTIFICATION_ON)
  {
    notification_on_off = Sensor_data_NOTIFICATION_ON;
  }
  /* USER CODE END Service1Char2_NS_1*/

  if (notification_on_off != Sensor_data_NOTIFICATION_OFF && WEARABLE_APP_Context.ConnectionHandle != 0xFFFF)
  {
    WEARABLE_NotifyValue(WEARABLE_SENSOR_DATA, &wearable_notification_data, WEARABLE_APP_Context.ConnectionHandle);
  }

  /* USER CODE BEGIN Service1Char2_NS_Last*/

  /* USER CODE END Service1Char2_NS_Last*/

  return;
}

__USED void WEARABLE_Device_status_SendNotification(void) /* Property Notification */
{
  WEARABLE_APP_SendInformation_t notification_on_off = Device_status_NOTIFICATION_OFF;
  WEARABLE_Data_t wearable_notification_data;

  wearable_notification_data.p_Payload = (uint8_t*)a_WEARABLE_UpdateCharData;
  wearable_notification_data.Length = 0;

  /* USER CODE BEGIN Service1Char3_NS_1*/
  WEARABLE_RefreshStatusSnapshot();
  memcpy(a_WEARABLE_UpdateCharData, wearable_status_snapshot, WEARABLE_STATUS_PAYLOAD_LENGTH);
  wearable_notification_data.Length = WEARABLE_STATUS_PAYLOAD_LENGTH;
  if (WEARABLE_APP_Context.Device_status_Notification_Status == Device_status_NOTIFICATION_ON)
  {
    notification_on_off = Device_status_NOTIFICATION_ON;
  }
  /* USER CODE END Service1Char3_NS_1*/

  if (notification_on_off != Device_status_NOTIFICATION_OFF && WEARABLE_APP_Context.ConnectionHandle != 0xFFFF)
  {
    WEARABLE_NotifyValue(WEARABLE_DEVICE_STATUS, &wearable_notification_data, WEARABLE_APP_Context.ConnectionHandle);
  }

  /* USER CODE BEGIN Service1Char3_NS_Last*/

  /* USER CODE END Service1Char3_NS_Last*/

  return;
}

__USED void WEARABLE_Nfc_data_SendNotification(void) /* Property Notification */
{
  WEARABLE_APP_SendInformation_t notification_on_off = Nfc_data_NOTIFICATION_OFF;
  WEARABLE_Data_t wearable_notification_data;

  wearable_notification_data.p_Payload = (uint8_t*)a_WEARABLE_UpdateCharData;
  wearable_notification_data.Length = 0;

  /* USER CODE BEGIN Service1Char4_NS_1*/

  /* USER CODE END Service1Char4_NS_1*/

  if (notification_on_off != Nfc_data_NOTIFICATION_OFF && WEARABLE_APP_Context.ConnectionHandle != 0xFFFF)
  {
    WEARABLE_NotifyValue(WEARABLE_NFC_DATA, &wearable_notification_data, WEARABLE_APP_Context.ConnectionHandle);
  }

  /* USER CODE BEGIN Service1Char4_NS_Last*/

  /* USER CODE END Service1Char4_NS_Last*/

  return;
}

__USED void WEARABLE_Ecg_data_SendNotification(void) /* Property Notification */
{
  WEARABLE_APP_SendInformation_t notification_on_off = Ecg_data_NOTIFICATION_OFF;
  WEARABLE_Data_t wearable_notification_data;

  wearable_notification_data.p_Payload = (uint8_t*)a_WEARABLE_UpdateCharData;
  wearable_notification_data.Length = 0;

  /* USER CODE BEGIN Service1Char5_NS_1*/

  /* USER CODE END Service1Char5_NS_1*/

  if (notification_on_off != Ecg_data_NOTIFICATION_OFF && WEARABLE_APP_Context.ConnectionHandle != 0xFFFF)
  {
    WEARABLE_NotifyValue(WEARABLE_ECG_DATA, &wearable_notification_data, WEARABLE_APP_Context.ConnectionHandle);
  }

  /* USER CODE BEGIN Service1Char5_NS_Last*/

  /* USER CODE END Service1Char5_NS_Last*/

  return;
}

__USED void WEARABLE_Debug_data_SendNotification(void) /* Property Notification */
{
  WEARABLE_APP_SendInformation_t notification_on_off = Debug_data_NOTIFICATION_OFF;
  WEARABLE_Data_t wearable_notification_data;

  wearable_notification_data.p_Payload = (uint8_t*)a_WEARABLE_UpdateCharData;
  wearable_notification_data.Length = 0;

  /* USER CODE BEGIN Service1Char6_NS_1*/

  /* USER CODE END Service1Char6_NS_1*/

  if (notification_on_off != Debug_data_NOTIFICATION_OFF && WEARABLE_APP_Context.ConnectionHandle != 0xFFFF)
  {
    WEARABLE_NotifyValue(WEARABLE_DEBUG_DATA, &wearable_notification_data, WEARABLE_APP_Context.ConnectionHandle);
  }

  /* USER CODE BEGIN Service1Char6_NS_Last*/

  /* USER CODE END Service1Char6_NS_Last*/

  return;
}

__USED void WEARABLE_Recovery_data_SendNotification(void) /* Property Notification */
{
  WEARABLE_APP_SendInformation_t notification_on_off = Recovery_data_NOTIFICATION_OFF;
  WEARABLE_Data_t wearable_notification_data;

  wearable_notification_data.p_Payload = (uint8_t*)a_WEARABLE_UpdateCharData;
  wearable_notification_data.Length = 0;

  /* USER CODE BEGIN Service1Char7_NS_1*/

  /* USER CODE END Service1Char7_NS_1*/

  if (notification_on_off != Recovery_data_NOTIFICATION_OFF && WEARABLE_APP_Context.ConnectionHandle != 0xFFFF)
  {
    WEARABLE_NotifyValue(WEARABLE_RECOVERY_DATA, &wearable_notification_data, WEARABLE_APP_Context.ConnectionHandle);
  }

  /* USER CODE BEGIN Service1Char7_NS_Last*/

  /* USER CODE END Service1Char7_NS_Last*/

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS*/
static void WEARABLE_FillSensorPayload(uint8_t *payload)
{
  wearable_sensor_data_t data;
  if (SensorManager_GetLatestData(&data))
  {
    WearableData_EncodeSensor(&data, payload);
  }
  else
  {
    memset(payload, 0, WEARABLE_SENSOR_PAYLOAD_LENGTH);
  }
}

static void WEARABLE_RefreshSensorSnapshot(void)
{
  WEARABLE_FillSensorPayload(wearable_sensor_snapshot);
}

static void WEARABLE_RefreshStatusSnapshot(void)
{
  wearable_sensor_data_t sensor_data;
  wearable_device_status_t status = {0};
  sensor_temperature_status_t temperature_status;
  status.measurement_state = (uint8_t)WearableState_Get();
  status.sensor_ready = SensorManager_GetLatestData(&sensor_data) ? 1U : 0U;
  status.error_code = WEARABLE_APP_Context.ErrorCode;
  temperature_status = SensorManager_GetTemperatureStatus();
  if (status.error_code == WEARABLE_ERROR_NONE)
  {
    if (temperature_status == SENSOR_TEMPERATURE_NOT_PRESENT)
    {
      status.error_code = WEARABLE_ERROR_TEMP_NOT_PRESENT;
    }
    else if (temperature_status == SENSOR_TEMPERATURE_TIMEOUT)
    {
      status.error_code = WEARABLE_ERROR_TEMP_TIMEOUT;
    }
    else if (temperature_status == SENSOR_TEMPERATURE_BUS_ERROR)
    {
      status.error_code = WEARABLE_ERROR_TEMP_BUS;
    }
  }
  if (status.sensor_ready != 0U)
  {
    status.power_state = sensor_data.power_state;
    status.supercap_mv = sensor_data.supercap_mv;
    status.flags = sensor_data.flags;
  }
  status.reset_counter = WEARABLE_APP_Context.ResetCounter;
  WearableData_EncodeStatus(&status, wearable_status_snapshot);
}

