TuanPT176/BLE_Wearable/STM32_BLE/App/wearable_app.c
static void WEARABLE_SensorTask(void)
{
  if (WearableState_AllowsPeriodicMeasurement())
  {
    SensorManager_Process();
    WEARABLE_RefreshSensorSnapshot();
    WEARABLE_ScheduleSensorAsyncTask();
  }

  if ((WEARABLE_APP_Context.ConnectionHandle != 0xFFFFU) &&
      (WEARABLE_APP_Context.Sensor_data_Notification_Status == Sensor_data_NOTIFICATION_ON))
  {
    WEARABLE_Sensor_data_SendNotification();
  }

  if (WearableState_AllowsPeriodicMeasurement())
  {
    HAL_RADIO_TIMER_StartVirtualTimer(&wearable_sensor_timer, WEARABLE_SENSOR_PERIOD_MS);
  }
}

static void WEARABLE_SensorTimerCallback(void *arg)
{
  UNUSED(arg);
  UTIL_SEQ_SetTask(1U << CFG_TASK_WEARABLE_SENSOR_ID, CFG_SEQ_PRIO_0);
}

static void WEARABLE_SensorAsyncTask(void)
{
  if (WearableState_AllowsPeriodicMeasurement())
  {
    SensorManager_ProcessAsync();
    WEARABLE_RefreshSensorSnapshot();
    WEARABLE_ScheduleSensorAsyncTask();
  }
}

static void WEARABLE_MotionInterruptTask(void)
{
  SensorManager_ProcessMotionInterrupt();
  WEARABLE_ScheduleMotionTimeout();
  WEARABLE_RefreshStatusSnapshot();
}

static void WEARABLE_MotionTimeoutTask(void)
{
  SensorManager_ProcessMotionTimeout();
  WEARABLE_RefreshSensorSnapshot();
  WEARABLE_RefreshStatusSnapshot();
}

static void WEARABLE_MotionTimerCallback(void *arg)
{
  UNUSED(arg);
  UTIL_SEQ_SetTask(1U << CFG_TASK_WEARABLE_MOTION_TIMEOUT_ID,
                   CFG_SEQ_PRIO_0);
}

static void WEARABLE_ScheduleMotionTimeout(void)
{
  uint32_t delay_ms;

  HAL_RADIO_TIMER_StopVirtualTimer(&wearable_motion_timer);
  if (SensorManager_GetMotionDelayMs(&delay_ms))
  {
    HAL_RADIO_TIMER_StartVirtualTimer(&wearable_motion_timer, delay_ms);
  }
}

static void WEARABLE_SensorAsyncTimerCallback(void *arg)
{
  UNUSED(arg);
  UTIL_SEQ_SetTask(1U << CFG_TASK_WEARABLE_SENSOR_ASYNC_ID, CFG_SEQ_PRIO_0);
}

static void WEARABLE_ScheduleSensorAsyncTask(void)
{
  uint32_t delay_ms;

  HAL_RADIO_TIMER_StopVirtualTimer(&wearable_sensor_async_timer);
  if (SensorManager_GetAsyncDelayMs(&delay_ms))
  {
    HAL_RADIO_TIMER_StartVirtualTimer(&wearable_sensor_async_timer, delay_ms);
  }
}

static void WEARABLE_StopSensorAsyncTask(void)
{
  HAL_RADIO_TIMER_StopVirtualTimer(&wearable_sensor_async_timer);
}

static void WEARABLE_SendStatus(void)
{
  WEARABLE_Device_status_SendNotification();
}
/* USER CODE END FD_LOCAL_FUNCTIONS*/
